       IDENTIFICATION DIVISION.
       PROGRAM-ID. BrainModel.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NEURON PIC 99 VALUE ZEROS.
       01 INPUT-DATA PIC 99 VALUE ZEROS.
       01 SENSORY-INPUT OCCURS 10 TIMES PIC 99 VALUE ZEROS.
       01 ENCODED-DATA OCCURS 10 TIMES PIC 99 VALUE ZEROS.
       PROCEDURE DIVISION.
       A000-MAIN.
           PERFORM VARYING NEURON FROM 1 BY 1 UNTIL NEURON > 10
               DISPLAY "Enter sensory input data (1 to 10) for neuron ", NEURON, " : "
               ACCEPT INPUT-DATA
               MOVE INPUT-DATA TO SENSORY-INPUT (NEURON)
               MOVE SENSORY-INPUT (NEURON) TO ENCODED-DATA (NEURON)
           END-PERFORM
           PERFORM VARYING NEURON FROM 1 BY 1 UNTIL NEURON > 10
               DISPLAY "Retrieved data from neuron ", NEURON, " is ", ENCODED-DATA (NEURON)
           END-PERFORM
           STOP RUN.
